## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/f29cb374-e4e0-44de-ae0f-2d269c5f5d3e).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpe7ouw2yv/plan`

```diff
2024-12-02T20:40:35.863Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T20:40:35.863Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T20:40:35.863Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T20:40:35.863Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T20:40:35.863Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T20:40:35.863Z [INFO]  Go runtime version: go1.21.11
2024-12-02T20:40:35.863Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmpe7ouw2yv/plan"}
2024-12-02T20:40:35.863Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T20:40:35.863Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T20:40:35.863Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T20:40:35.863Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T20:40:35.863Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T20:40:35.863Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T20:40:35.863Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T20:40:35.863Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T20:40:35.863Z [INFO]  CLI command args: []string{"show", "/tmp/tmpe7ouw2yv/plan"}
2024-12-02T20:40:35.957Z [DEBUG] checking for provisioner in "."
2024-12-02T20:40:35.957Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T20:40:35.957Z [DEBUG] created provider logger: level=debug
2024-12-02T20:40:35.957Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:40:35.971Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T20:40:35.971Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=349
2024-12-02T20:40:35.971Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T20:40:35.981Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T20:40:35.981Z
2024-12-02T20:40:35.995Z [DEBUG] provider: using plugin: version=6
2024-12-02T20:40:35.995Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: network=unix address=/tmp/plugin718370069 timestamp=2024-12-02T20:40:35.995Z
2024-12-02T20:40:36.030Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:40:36.031Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=349
2024-12-02T20:40:36.031Z [DEBUG] provider: plugin exited
2024-12-02T20:40:36.031Z [DEBUG] created provider logger: level=debug
2024-12-02T20:40:36.031Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:40:36.037Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T20:40:36.037Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=358
2024-12-02T20:40:36.037Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T20:40:36.041Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T20:40:36.040Z
2024-12-02T20:40:36.056Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin618452272 network=unix timestamp=2024-12-02T20:40:36.056Z
2024-12-02T20:40:36.056Z [DEBUG] provider: using plugin: version=5
2024-12-02T20:40:36.067Z [DEBUG] No provider meta schema returned
2024-12-02T20:40:36.067Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:40:36.068Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=358
2024-12-02T20:40:36.068Z [DEBUG] provider: plugin exited
2024-12-02T20:40:36.068Z [DEBUG] created provider logger: level=debug
2024-12-02T20:40:36.068Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:40:36.074Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T20:40:36.074Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=366
2024-12-02T20:40:36.074Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T20:40:36.124Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T20:40:36.124Z
2024-12-02T20:40:36.143Z [DEBUG] provider: using plugin: version=5
2024-12-02T20:40:36.143Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin1737406875 network=unix timestamp=2024-12-02T20:40:36.143Z
2024-12-02T20:40:36.162Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x94U[lWf׻\xf6\xf1\xfa\xb2\xbf׷\xdf\xeb\xdb\xe4\xf8\x92\xf56\x9e\xf1۹\xb4I\x9a\xc4ED@\xaaG<PUf2{\xbcevf\x99\x99\xdd\xc4o~(U%\xc4E
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: T\xbc@\x8b)MQJJ!ѪU\xa5\x90\xaa B\xa2\xa9P\x8a\xaa\xaa\xd4"%E\xe7\xcc\xec%\xce\xd6I\xf3\xb0\xcfw\xf9\xff9\xdf\xce9|\xe5\xfa\xb5\xbf\xe3\xdaߞ\xc4D\x8cD \x9a\x88\x91\x88}\xe6\xaf\xac|E>~u\xe3\xdc\xf5\xc1w\xfe\xf3z\x8d\x93\xfc4\x91,!\x88c\i\xa5$\x8ao\xfe\xe2r\x8d\x91(\xb84NZ\xe07ɈB\xb6)$KH\xb4c\xbb\x92\xa0@Z\xf0\xf6\xf5\xcb\xc2'OG%+\xd8!\xb1>\xf9\xf2\x87\xefF$\x87N\xecT\xba(\x908\xbe\xfc\xef\xabk\x85\xd7]+tc\xb7\x92\xa4\xa4ϾwU\xd4o\x83>'\x9em JO\x96)L)I
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa4\xcf|$}\xda\xe1\xed\x80\xd5\xbd\xd8+1\x82\xbf\xfc\xd9Q#\xef\xb4\xca\xfa	\xe8\xc3>\xa5\x9fi\xc7\xb7\xdeX\xbc\xda)\xb1\xc0\xa5\x9f&IϽu&Nc\xa4r\xea\x84AT\x90\xe9\xc0\x8b~\xa7q\xd2\xe7\x83r]0\x84CJ\x9a\xe9\xc47~\xfc\x9c\xc0\xba\xe1\xa5 \xeb\x86aVF(\x90.|\xe9w\x96\x84\x82\xa5H\xc2(\x8e*c4I\xba\xf1\xb9\xf3D9\x80\x8a,0\x8e\xe3J\xe2\x8ds7\xbbh\x8c\xf4@JB=\xa0\xa0\xa2l\xa3@ \xcf_\xfdV\x94\xc6I
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: n\x8e)\xa0H\x95\x89\xd4D@\xa4\x9c\x80H\xb4%om#퉎ή\xee$P =x\xfa\xec\xe2\xbb{\xe1\xc3^i\xd9\x938)sO\xe1\xc5__\xeb\xde\xa7h\x9c\xf4\xc3_\xe3>\x98\xc2)\x99{?L\xe3\xb4̶\xbf\xf9n\x98\xfb\xa3\xa1@\xfa\xf0G7d\xf0\xf5\xe0\xf3`;n\x97\x89\xf6\xe3ko\xcbDh\x9c \xbc8B32Q\x84\x9cQ\x924I\xf0\xf9+\x92;\xb6lp\xb2\x98\x95\x81\xe2\xef_\xf8\x9fh>C\x9b\x86\xf0eM\xc4'\xfe\xfc\x91h~\xf6K\xd90\xcc⬄\x86\xf0\xe7g?\xd0\xec\x94\xd0\xa8\xa8*\x92\xc6+\xaf\xbc/G\xe1B\x87\xc4Fa\xe7\x94%\xc3x\xfa\xcc?c4N\xc6\xe0v\x82\xc6\xc98\xbc\x97\xa01\xa2\x80b\xbf\x8cC\xa6䲄\x8c\xc3<\xce\xcb'pAY\xa4@F\xf0\xe2\xa5[B\xbc\xbe|\xeb6؉;\x95]\xc8(\xfe\xf6\xfa\xf7\xc50P\xb8\xcc%\x85ݸ[\xd9C\x81\x8c\xe1\x8b\x91\xd8\xfc)\xc0&\xe0A|Pb\xe3\xf8\xea\x9b\x9b\x84K6	\xe1Cʞ\x86\xc8{R\xbd\xb1\xbe\xfe\x81AJ\x8f\x8c\x8e\x8dS 
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: >}:\x8c\xfcJJF\xb5P\xef\x99 <\x8aO\xfdJn\xd5)\xf8v\xd0\xee\xecŽr\xabN\xe0\xf7n\xca`[\xe1u\xc1N\x92I\xbcv\xeb_bA\xa7aT.\xda4\xec\xc3}\xca~
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: d
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x9fxKF\xb4\xbd\xda\xe3vx\x969L\xe3\x8bՈ>\x91T\xba:\xa7=Jj\x9dhm\x9b\x9c\x9a\xbbN\x89\xc0\xc6\xc6F7.\xdd\xec\xca\xd8I\xf7\x91(l<\xfb\xdfk|<\x8e\xff\x90\xffg\xa6ӤE\xf0n,\xfeEp\xe3\xd9\xeac\xe6\xfbk\xf3\xf4b\xc9\xe2\x8bN\xd9\xf6Y\x8bQ*\xb3[\xb7\x8f\x8e\x9d\xf7ؔᮗ|G\xe3\x96e\x96|\xd3\xd0L\xdb箭[ڪ\xa9\xfbji\x91厔-\xb6\xc3؊\xa6\x95YnEv.\xa8\x87\xcd[\xb1\xd5L\xf6\xe8"\xcb}\xd6\xe2En\xfb3\xaa\xf0ߺ鿵\xb1mz>7B룎)\x8c\xe6\xf3l\xfb'\xb6(jֻ\xeeA\xbc\xd3z\xd9\xd0-\xdd=R\xb6|\x96\xd9$T\xc5b,\x95\xdd
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: Y\x87t\x8fK\xe6\xe0&f\xadv\xba
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: yOW+\xdc5W\xd7?\xc7m\xee\x9a\xeboĴ\x80QpXo\xe3\xebP_\xdc\xdbѽ\xe2݊/\xcb"\xf5\x96d\xe5\xe0\xe5\xc1\xe5Gs\xb5\x96N-\xce\xedQ\x8d5n\x9cX6\xb6\xee\x97]^\xab-0\xf9#\xecG\xc3\xda⥺\xe4r\xdd\xe7K\xdc\xf5\xcdU\xd3\xd0}\xce(\x98\xfeZ\xf9\xb8j8EmM\xf7\xd6L\xc3qKZ\xc1\x99-Y\xe5\x82i\xabnsW4lvk\xf2\x81JN]P\xb4\xa2oy\xa2\xf4\xe4\xd6tu\x99\xbbδ\xadYUSO\x90]a{\xa8\xa9\xc0箫\xaf:n1\xec|\xb6\xe0h\xfej\xc9u|\xa7\xb2\xa8\xf9\xab\x8b\xa1AP\xf4\xc8\xfdz\xa8̩{\xd4\3\xabOߒ\x97?\xa1U\x98V
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x96\xb6\xd6S\xd0\xd2#\xf7\xd7R\xe0q\xa0\xc2\xd4\xdc.u.\xf4
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: Z\x8b\xb3\xe7Ӹ\x84\xeapMڋ\xbai\xab\xe2\x87)\xab\xe9:3\xcf\xddY\xfd\x84\xee\xadiu:ݲ\xed\x9bE\xf0\x93\xe1_Z\xc9uo\xde|M\x8e\xaf寕u\x97\xb3\xf9p>?\xe1\xa0\xdbt&\xddS\x9c\xa1,<oq\xca\xc7-ΰZI\xee)\xcf,\xd8ս\xdcs\xb2\xe9\x95\xd8cl\xfcV&{\xd45+\xbaϿ\xc0\xd7g¾\x90 \xc6?\x93\xe6\xed\xb0n\xe7\xbd5\xfd_\xf6u\x9f\xfb\xe2rn~F\xf5\xb8\x9d\x97\xa1\xbb\x8d[q\xb2.\xd7֪\xb2\x95\xc0fŷ\xbcܼZpX\xae\xceںH͂\xd1;$K\x8em\x8b\xdc
2024-12-02T20:40:36.325Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xafw\xc7\xc6ꜻ\x8a\x8b\xb2u\̈́\xb5
2024-12-02T20:40:36.328Z [DEBUG] provider.terraform-provider-akash_v0.1.1: K\x8e\xed\xf3S>K\xd5I\x9a\xe1\xd8rP\x9a	k\x8bR\x8eԅ5\xf7\x89\xed/8N\xc1\xe3m\xe9vAu܂VpK\x86f\xb8<\xcfm\xdf\xd4-\xa1\xf2-o\xc9\xe5yo&\xe7\x86o\xcb5\xd7˓e\xb7:\xd7\xe8#\xb3+8losI}\x8c}W\xb7\xbd\x92\xe3\xfa\xea\xa3\xfcd\x90\xe5\xb1\xea+v\xb0\xb9\xbaVЬ\xde\xe55m\xcd\xf7K,[4\xc0\x9a[\xa8\x99lPlF\xb5\xf9\xc9\xc3ǎe\xf5\xb2\x99\xe6\x9aZ\xd9`\x94\x84\xbbڜ\xd9\xe0.\xb2\xb5\xf8\x97\xf4\x93b\؎{\xf2eW\xeaj\xd96\xe6k\x83\\xdd\xd2wݼ\xf2\xd6m\x8c\xe0j\xad%.\xb6[p\xa55N\x94^\xf6\xd7D\xf3\xf7\xbd\xcd\\xae\xe7\x97,\x93\xdb~\xe36{*\xde8\xdaI\xc7=\xe1\x95t\x83k\x96\xbe\xce]1\xb3.\xd7\xd4\xda\xd9'N3y\xf6y\x9a\xcb\xa6\xe7\xbb\xebuP5\xcd*\xf9I~\\x8e\xc695\xa7\xe64˴˧V\xf4b~\xe7B\xe3\x9dt\xc7)\xbaR\x91\\xd6\xfaX%\xef9\x8f\xb3\xc4co\xdd3t\xcbz\xfc\xff  \xff\xff\x94\xe99(  
2024-12-02T20:40:36.328Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=366
2024-12-02T20:40:36.328Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
